benchmark/old_outputs/single_thread/clock_new/zipf_4/2026-04-17T17:04:31-04:00_1_1_1.5.txt
pgbench (19devel)
transaction type: multiple scripts
scaling factor: 1000
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 2045825
number of failed transactions: 0 (0.000%)
latency average = 0.176 ms
initial connection time = 2.841 ms
tps = 11365.866890 (without initial connection time)
SQL script 1: pgscripts/zipfian_select.sql
 - weight: 1 (targets 50.0% of total)
 - 1023374 transactions (50.0% of total)
 - number of transactions actually processed: 1023374 (tps = 5685.497373)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.078 ms
 - latency stddev = 0.014 ms
SQL script 2: pgscripts/zipfian_update.sql
 - weight: 1 (targets 50.0% of total)
 - 1022451 transactions (50.0% of total)
 - number of transactions actually processed: 1022451 (tps = 5680.369517)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.273 ms
 - latency stddev = 0.115 ms
ratio: .9954278545447187